#+TITLE: MY DOOM EMACS
#+AUTHOR: Swapnil Mahajan (swapnilsm@)
#+STARTUP: SHOWEVERYTHING
#+OPTIONS: TOC:2
#+PROPERTY: header-args:elisp :tangle ~/.doom.d/config.el

*** Sensible defaults
#+BEGIN_SRC elisp
(after! org-agenda
  (map! :localleader
        :map org-agenda-mode-map
        "s" #'org-save-all-org-buffers)
  (setq org-agenda-skip-scheduled-if-deadline-is-shown t
        org-agenda-include-deadlines t
        org-agenda-show-all-dates nil
        org-agenda-compact-blocks t
        org-agenda-show-inherited-tags nil
        org-agenda-start-day nil
        org-agenda-breadcrumbs-separator " > "
        org-agenda-current-time-string "            "
        org-agenda-prefix-format
        '((agenda . " %i %?-12t %s %50b")
          (todo . " %i %?-12t %11s %50b")
          (tags . " %i %?-12t % s %50(sm-get-short-prefix) > ")
          (search . " %i %?-12t % s %50(sm-get-short-prefix) > "))
        org-agenda-span 1))
#+END_SRC

#+RESULTS:
: 1

